{
	"header": "Purpose. Process. People.",
	"bcorp top": "We're deeply committed to the nonprofit sector. In fact, we're undergoing the rigorous standards to earn B Corporation certification.",
	"bcorp more": "CohenTaylor is being certified by nonprofit B Lab as a B Corporation. Because we believe that successful business is more than profit margins, our values of sustainability, honesty, and transparancy lead our day-to day work and have allowed us to apply for this certification. We are a force for good, and our B Corp status reinforces that founding principle. Click on the logo to the left to learn more.",
	"values top": "We find leaders who truly share your values.",
	"pillars":[
		{
			"value-top": "Purpose first",
			"value-bottom": "Purpose first:",
			"value-more":  "We ask what your organization believes and why you do what you do.",
			"value-complete" "Purpose drives why people join an organization, and why they stay. 
				Our partner-driven search effort starts each search assignment by learning about 
				your organization’s purpose. We listen and learn by taking the necessary time to 
				engage internal and external stakeholders. This discovery means learning as much as 
				we can about this role from key staff and critical stakeholders. 
				
				Our efforts are structured to get information about the organization, industry trends, 
				organizational values, internal culture, and the ‘fit’ required to make a new leader successful. 
				Giving stakeholders a voice in this information-gathering process is critical and often overlooked. 
				It is also essential to building the position profile—a marketing tool we use to promote the 
				brand and to recruit potential candidates."
		},
		{
			"value-top": "Process second",
			"value-bottom": "Process second:",
			"value-more": "We learn what talents and requirements are needed to deliver on your purpose.",
			"value-complete": "The bedrock of great executive search is a comprehensive, proactive, and targeted 
				search process. At CohenTaylor, we use the latest tools and research to build a multi-channel and 
				proactive search process. That process is directed by the attributes and experiences required at 
				the specific time in the organization’s lifecycle. The process is part ‘art’ and part ‘science.’

				In partnership with our client, we work to deliver on a process that is both ‘turnkey’ and also 
				keeps the hiring team engaged in very specific ways throughout the search. Typically, committee 
				involvement is needed at the front end of the search, and then again at the back end with candidate 
				review and first and second round interviews. At the start of each search, we are intentional to set 
				a communications plan and timeline with dates and deliverables."
		},
		{
			"value-top": "People third",
			"value-bottom": "People third:",
			"value-more": "We find the candidates who will make an impact on your organization and a difference in our community.",
			"value-complete": "Selecting a search partner who brings an understanding of the competencies of people engaged 
				in similar roles, and any new competencies required to deliver on strategic priorities, will be important. 
				With our decades of nonprofit, business, and executive search experience, we believe our team has the combined 
				experience to help the YWCA bring forward the right people who have demonstrated success in the competencies 
				required to deliver on strategic imperatives for the strongest impact."
		}
	],
	"clients":[
		{
			"company-name": ,
			"positions-placed": 
		},
		{
			"company-name": ,
			"positions-placed": 
		},
		{
			"company-name": ,
			"positions-placed": 
		}
	],
	"team":[
		{
			"name": "Chris Cohen",
			"top-paragraph": ,
			"more-paragraph": 
		}
		{
			"name": "Don Taylor",
			"top-paragraph": ,
			"more-paragraph": 
		}
		{
			"name": "Katie Erickson",
			"top-paragraph": ,
			"more-paragraph": 
		}
		{
			"name": "Joel Bergstrom",
			"top-paragraph": ,
			"more-paragraph": 
		}
		{
			"name": "Beau Bye",
			"top-paragraph": ,
			"more-paragraph": 
		}
		{
			"name": "Shannon Mahedy",
			"top-paragraph": ,
			"more-paragraph": 
		}
	],
	"contact":[]
}